[
{"listing": {"name": "Heaven Restaurant & Boutique Hotel", "reviews": [{"title": "There is no place like Heaven", "review": "I stayed at Heaven a few years ago while on business and loved it!  I enjoyed staying there so much that I booked it again when I knew I was returning to Rwanda!  It is a special retreat on a clean, quiet street in the...", "date": "November 6, 2018", "user": "Valerie533"}, {"title": "LOVED, LOVED, LOVED Heaven", "review": "We were taken there by our tour operator, so we had tempered expectations....but it was a wonderful surprise..The food was outstanding, local, huge portions and priced very well..The drinks were high quality and they had a full bar as well as beer/wine.\nService was great...", "date": "March 6, 2018", "user": "Michael S"}, {"title": "Unexpected stay", "review": "I stayed at the hotel as my original hotel was overbooked. As I travel with an assistance dog it is not easy to find accommodation. The accommodation is beautful and clean. The staff are professional , kind and helpfull. I do hope to stay again...", "date": "November 3, 2018", "user": "Storyteller744757"}, {"title": "Heaven is Home", "review": "Our fam spent the summer traveling through East Africa, mostly Rwanda. Of all the places we visited, the sense of home, spirit of renewal, standard of excellence we experienced at Heaven was unmatched", "date": "November 1, 2018", "user": "rsjaitly"}, {"title": "Our go-to place to stay in Kigali", "review": "Excellent food, beautiful view from the restaurant, exceptional customer service and amenities - What else could you want? The staff sets up a baby cot complete with mosquito net prior to our arrival, which is a thoughtful and personal touch. I also like that they...", "date": "October 31, 2018", "user": "whitney162"}]}},
{"listing": {"name": "Step Town Motel", "reviews": [{"title": "Helpful personnel ", "review": "We stayed only one night in the Step Town but were happy that have chosen this hotel. We arrived in the late afternoon, when the heavy rain started in Kigali. It was very kind that staff provided an umbrella, otherwise we would've been wet. The...", "date": "October 12, 2018", "user": "Shimnik"}, {"title": "Pleasant surpise", "review": "This motel is a little off the beaten track and I was feeling a bit anxious as we turned off the well lit main road, onto a dirt road with rough corrugations, into the back streets of Kigali.\nHowever once we arrived at the Step...", "date": "October 4, 2018", "user": "June S"}, {"title": "Adequate for short visits ", "review": "This hotel was fine for our two night stay. Nothing to write home about but functional and fine for a short visit, especially one where we were out of the hotel all day sightseeing.\n\nThe staff were helpful and friendly, the bed was relatively comfortable,...", "date": "September 12, 2018", "user": "West_Cork_Lass"}, {"title": "A Beautiful place to stay in Kigali", "review": "I Loved staying at Step Town motel! \nJohn who runs the accommodation, is one the nicest most helpful people I've met travelling, really went out of his way to assist me, everything from advice, to transport, to finding me a place to stay when I...", "date": "July 27, 2018", "user": "FrancoisPet"}, {"title": "Comfortable and friendly", "review": "The Step Town hotel is a quiet and comfortable place. Rooms have hot shower, mosquito nets and a very nice view on Kigali. There is even a large shared balcony at the first floor.\nThe staff is vert kind and nice and ghere is a...", "date": "July 15, 2018", "user": "Carlo T"}]}},
{"listing": {"name": "Grand Legacy Hotel", "reviews": [{"title": "Review of Grand Legacy", "review": "I went back to Grand Legacy and they have thoroughly improved services. The rooms are excellent that means spacious ,neat and very clean and comfortable. \nService levels are really good and I have no complaint .", "date": "November 7, 2018", "user": "Hazel G"}, {"title": "Absolutely wonderful hotel!", "review": "There are so many reasons to stay at this hotel!  Let me name a few:  close to Kigali International Airport (10 minutes away); elegant, comfortable, beautiful, clean, as nice as any 5* hotel in the USA!  In addition, the staff and management were extremely helpful,...", "date": "October 8, 2018", "user": "Diane S"}, {"title": "Comfortable and friendly hotel with location where you can avoid traffic to go to the airport.", "review": "Comfortable and friendly hotel with ample space in the room.  One of the best feature about the hotel is that it has great lighting in the room which allow you to work comfortably.  Good Internet connection is nice as well.", "date": "October 2, 2018", "user": "Atuchan"}, {"title": "The best hotel I have stayed at in Kigali", "review": "Stayed at Grand Legacy for over a week due to work. This is a well-kept, very clean and service minded hotel in the heart of Kigali. The staff is extremely helpful and accommodating, ready to help you with whatever request one have. The rooms are...", "date": "August 19, 2018", "user": "annaa380"}, {"title": "Solid base while in Kigali", "review": "I had almost a week at Grand Legacy. The rooms were super comfy and very spacious. Staff were genuinely friendly and helpful. The pool is big enough to actually swim in (which is always a bonus!). The one gripe all of our party had was...", "date": "July 20, 2018", "user": "Martin D"}]}},
{"listing": {"name": "Five to Five Hotel", "reviews": [{"title": "My stay in Kigali", "review": "very conducive environment, nice night ambiance, comfortable bed and large room space, a quite place for meditation and excellent breakfast, enjoyed reception process, with a glass of mango Juice, very cordial and welcoming  support  staff", "date": "November 5, 2018", "user": "Getaway547317"}, {"title": "Excellent, especially for families", "review": "This place is awesome. Emailed about free airport pick up and received a confirmation email. Henriette was there and easily visible as we exited the airport. She directed us to the best forex and then took us to the hotel. We were greeted with fresh...", "date": "November 5, 2018", "user": "LightPacker714007"}, {"title": "Mrs", "review": "Transportation was arranged to pick us up from the airport. The room was clean and the staff were very friendly. We enjoyed our stay because the place was serene and the breakfast was nice. There was Wi-Fi with strong signal making it easy for us...", "date": "November 5, 2018", "user": "Fearless791137"}, {"title": "Wonderful Hotel with Wonderful Service", "review": "Five To Five is an all around great hotel. The building is in a nice location, with a nice view and close to the airport. However, what really make this place awesome is the staff. They are incredibly welcoming, friendly and helpful. The included breakfast...", "date": "November 3, 2018", "user": "Dan G"}, {"title": "Excellent Location for Exploring Rwanda", "review": "We booked a 5 day trip to Rwanda and Uganda and this hotel was an excellent end to our stay - it was chosen by the tour company.  Everyone on the staff welcomed us and made us feel at home.  The room was nicely decorated...", "date": "October 30, 2018", "user": "Betsy99"}]}},
{"listing": {"name": "Kigali Marriott Hotel", "reviews": [{"title": "The Country of a Thousand Hills", "review": "My colleague and I arrived without reservations. Ms. Nancy, at reception, made the arrangements painless. She was very polite and professional.\nWe were fortunate to have access to the Executive Lounge where we spent a great deal of time. The Lounge host/hostesses made the visit...", "date": "November 3, 2018", "user": "jimfin6"}, {"title": "Question the value ", "review": "Was booked into what was referred to as Club Room Pool access but overlooked the hotel entrance security barrier no sign of any pool access.\nAttending Conference as were many other guests but each were charged $20 each way to the conference centre when other...", "date": "October 31, 2018", "user": "Shaun Z"}, {"title": "Excellent food options, comfortable rooms and efficient staff and servers", "review": "I stayed a week and apart from a muddle at the beginning when my television screen welcomes someone other than me, I had a trouble free stay, although I used the room's amenities fully and spent a great deal of time in the room. Staff...", "date": "October 30, 2018", "user": "Lionel S"}, {"title": "Great Service, location could be better", "review": "Amazing hotel My Marriot, amazing rooms, good amenities. Great place to stay if it is a work visit. Fast WIFI, work table with light and room service. Staff is english speaking makes it much easier to get around. \nRestaurant has a good menu, breakfast is...", "date": "October 30, 2018", "user": "DMAtuhe"}, {"title": "THE place to stay", "review": "Great place to start / finish your trip to Rwanda. It’s the center of travel and business life. Very accommodating. As nice as any hotel in US. Very safe. Very clean. Good food. Make sure you bring an extra bag with things you intend on...", "date": "October 28, 2018", "user": "Mark M"}]}},
{"listing": {"name": "Kigali Serena Hotel", "reviews": [{"title": "Kigali", "review": "Was there for a training so when doing the booking the response time was supper slow.  I got there and Schola and her team in reservations turned things around and made the experience worth my while.  The team on ground were supper helpful and did...", "date": "October 30, 2018", "user": "Tina O"}, {"title": "Fun and Value...", "review": "Our choice of Rwanda for this year's Destination Meet Up was not a mistake. Settling for Kigali Serena Hotel as our hotel was awesome. We are a  group of old friends all former classmates in Igbobi College Yaba, Lagos Nigeria. Have known each other for...", "date": "October 28, 2018", "user": "Wole A"}, {"title": "Excellent experience at Kigali Serena", "review": "Visiting Serena Kigali is always a pleasant experience. The staff are very hospitable and professional that I feel very much like home. The GM Daniel Sambai was kind enough during my honeymoon this month to organize for me accommodation at Nairobi Serena and Amboseli Serena...", "date": "October 25, 2018", "user": "Moses M"}, {"title": "Kigali Serena, Home away from home", "review": "In September, a whole year since my last visit, I was greeted by name when I walked into Kigali Serena. It felt like I was back home. The rooms are spacious and airy. The decor is pleasing to the eye, done in warm colours. Service...", "date": "October 23, 2018", "user": "Susan M"}, {"title": "Great hotel", "review": "We stayed here on our last night in Africa after two weeks of exhausting Gorilla trekking through Uganda and in Volcanoes.  We were so pleased to find the Serena Hotel in Kigali to be a 5 star property.  Well maintained in excellent condition, the common...", "date": "October 4, 2018", "user": "Edmundo_de_ABQ"}]}},
{"listing": {"name": "Park Inn by Radisson Kigali", "reviews": [{"title": null, "review": null, "date": "November 4, 2018", "user": "Curiosity64596585019"}, {"title": "Consistent and great customer care from Staron bar tender at the pool bar", "review": "It's too infrequent good customer service is not recognised. I visit the Park Inn in Kigali quite frequently and every time your barman Staron is smiling, very customer focussed and very efficient. He is a credit to the Park Inn.", "date": "November 1, 2018", "user": "AndrewT4125"}, {"title": "Good hotel  with friendly staff", "review": "I enjoyed my stay at Par Inn. It is  a newly built hotel with all amenities that you look for comfort.  The hotel is within 2ml of Kigali Convention Centre and Kigali Genocide Memorial Convention Centre. \n\nThe quality of food was good, however, it could...", "date": "October 31, 2018", "user": "Happiness56803767197"}, {"title": "Good but can be much better", "review": "Not a bad hotel, very new, good location, good view and very friendly staff. However, the staff seems to have difficulties in English and also unfamiliar with Radisson Rewards program. When checking in, there was no acknowledgement of an elite member and although I asked...", "date": "October 31, 2018", "user": "PedroJoven"}, {"title": "It was a business visit,. we had around 7 rooms booked for a period of about 5 days.", "review": "Room was good, Well maintained.\nThe quality of Food also was good, although we only had breakfast there since Indian food is not available.\nLanguage is bit of a problem with the staff, however they are friendly. This is my third stay in last six...", "date": "October 29, 2018", "user": "sanjana593"}]}},
{"listing": {"name": "Hotel Paradis Malahide", "reviews": [{"title": "Relaxing GEM on the water! ", "review": "We stayed in a bungalow for two nights, our last two nights of our week in Rwanda.  \n\nOur bungalow was simple, tastefully decorated and very comfortable.  It was clean. The bed and mattress were comfortable, and we loved falling asleep to the sound of the...", "date": "October 11, 2018", "user": "mandyandian"}, {"title": "Lovely stay and tasty food", "review": "We've stayed at Paradis Malahide twice as our kayaking trip with Kingfisher journeys went from this lovely location. It's a great hotel, lovely clean rooms and tasty food. The outdoor seating area overlooking the lake is the perfect place to relax with a drink and...", "date": "September 27, 2018", "user": "Katie H"}, {"title": "Wonderful and relaxing stay at lake Kivu", "review": "Enjoy the sunset from the hotels beautiful garden area directly by the lake. There was nothing we missed in our three days at Paradis Malahide. The staff is super friendly and service oriented. The food was great as well ( try the tilapia with lemon...", "date": "August 21, 2018", "user": "luisedelius"}, {"title": "Very disappointing", "review": "We spend 2 nights there... it is an expensive place in Rwanda as 100$ for one night and we find a bungalow not so clean, no water at all during the second day and night,  breakfast is not fresh and very light, the common place...", "date": "August 20, 2018", "user": "lise c"}, {"title": "Paradise for relaxing and enjoying Kivu lake", "review": "Sambasa's ,litle dried and fried and served in wooden plates, a local specialty,  lake Kivu fich-limnotrica miodon-introduced in the '50 by Belgian colonials, environment of flowers and green, space and leasure on natural lava floors. When in Gisenyi I always go there, and show to...", "date": "August 7, 2018", "user": "KigaliErik"}]}},
{"listing": {"name": "Five Volcanoes Boutique Hotel", "reviews": [{"title": "Beautiful Accommodation", "review": "We stayed here just one night, but would have loved to stay longer.  The staff was so nice, (even cleaned our hiking boots after trekking!).  The room was beautiful and nicely appointed.  The food (breakfast and dinner) was delicious.  Loved the view of the volcanoes...", "date": "October 28, 2018", "user": "Anita D"}, {"title": "Great hotel with awesome views and lush landscape", "review": "This hotel is tucked away in a lush setting of trees and plants that attract many birds. We found the room very comfortable and the meals were delicious served in the covered outdoor dining area.  They also have a large pool and hammocks for relaxing.", "date": "August 14, 2018", "user": "Michelle L"}, {"title": "Great location for trekking", "review": "Five Volcanoes is a great location for gorilla trekking. The rooms are big but a little dark, all face a small patio. There is a nice pool. The staff is very friendly and helpful. Gaiters are provided and they clean your boots when you get...", "date": "October 27, 2018", "user": "AuntieMush"}, {"title": "Good Hospitality and good customer care", "review": "I had a team of 7 clients, high end, 4 adults and 3 kids, staying at the Volcano Manor.\n\nThe entire stay was amazing as they were given their privacy here.\n\nThe food was delicious, and the entire management were in constant contact with us...", "date": "October 22, 2018", "user": "odyekfred5"}, {"title": "Great Service", "review": "This is a good basic hotel with excellent service and great access to Mountain Gorilla Treks.\nThe best thing about the hotel is that they clean your hiking books and gators following the hike and return them looking brand new.\nRooms are clean and basic....", "date": "October 18, 2018", "user": "V S"}]}},
{"listing": {"name": "The Retreat", "reviews": [{"title": "The Retreat had us at Hello", "review": "Our fam spent 5 weeks in Africa, mostly Rwanda; The Retreat was where we started/finished. The Retreat refreshed us with its peace and inspired with its beyond-the-call-of-duty staff. Back again soon!", "date": "November 1, 2018", "user": "rsjaitly"}, {"title": "Stunning and Lives up to New York Times Review", "review": "We first discovered Heaven on our last trip to Kigali nearly 7 years ago, so we were thrilled to see that the owners have invested heart and soul in this extraordinary 11-room resort (we also ate at their two restaurants and stayed at their boutique...", "date": "August 20, 2018", "user": "Susie R"}, {"title": "African adventure", "review": "I travel across the world to spend a little time in Heaven which is the perfect name for this resort. The elegant Decor the friendly professional staff the amazing massage therapist were out standing. I can only say good things about this retreat the rooms...", "date": "October 29, 2018", "user": "SandyErnis"}, {"title": "GLI Loves the Retreat", "review": "A very unique and wonderful place in Kigali to enjoy everything that Rwanda has to offer!  We love the Retreat and the people who work here who are not just invested in providing you with a great hospitality experience, but are also very invested in...", "date": "October 28, 2018", "user": "Jamie33388"}, {"title": "\"Heavenly Place\"", "review": "This is a \"heavenly\" place and I recommend it highly.  The service all around and spa are excellent.\nIt is the perfect beginning for a trip to see the gorillas.  We also had a fun group dinner with entertainment.", "date": "October 28, 2018", "user": "WANDLPARENT"}]}},
{"listing": {"name": "2000 Hotel", "reviews": [{"title": "Good hotel, well located, stellar service", "review": "Very good and well located hotel in downtown Kigali , with great service, including a restaurant with international cuisine. Our housekeeper, Donatien, was excellent and left the room immaculate every day.", "date": "October 29, 2018", "user": "Andrea R"}, {"title": "ok if you're Chinese", "review": "This is a moderate hotel, situated in the lively part of Rwanda, close to the markets. I was their for a business trip. It suited my needs. The room was larger than expected, and moderate quality for the price. It was strange that some rooms...", "date": "October 28, 2018", "user": "Roger H"}, {"title": "Good service and hostability", "review": "The hotel staff (especially Claude concierge, Michaela, mugeni and deborah, etc. ) were so friendly and helpful. The hotel staff is well organized and available 24x7. The hotel is Clean and you get what they stayed. I am happy for choosing this hotel.", "date": "October 27, 2018", "user": "iyabdelnabi"}, {"title": "Amazing staff ", "review": "Excellent service from all staff across the bored. The house keeping was amazing, special thanks to Donatien who helped me throughout my stay. Hotel is such a lovely place to stay in Rwanda, the staff really do make you want to come back as they...", "date": "October 27, 2018", "user": "Elise W"}, {"title": "Great stay in 2000 Hotel, Kigali", "review": "2000 Hotel is a great hotel with very friendly staff. We received excellent service from Donatien. The hotel breakfast is superb with African tea and fresh fruits. We recommend people travelling to this destination.", "date": "October 26, 2018", "user": "ErikA2393"}]}},
{"listing": {"name": "Ubumwe Grande Hotel", "reviews": [{"title": "Great rooftop, good location", "review": "Modern but somewhat sterile decor.  Rooms are spacious with rainfall showers.  Staff mostly friendly but service not always the fastest.  Rooftop has great views of the city and very good food, reasonably priced.  Gym is very small.  Small issue but constant problems with the tv,...", "date": "November 2, 2018", "user": "CarlaB3180"}, {"title": "Shahnawaz", "review": "Beautiful Hotel, wonderful place. We liked the tikka masala at Rooftop restaurant. Service was not upto mark but food was good.\nGreat view from rooftop specially in the evening time from my room on 11th floor", "date": "October 29, 2018", "user": "Sarfaraz Nawaz M"}, {"title": "Nice Hotel", "review": "Room as big and comfortable,\nThe food is fast served, staff is friendly, we had Great happy hour at the Rooftop....\nThe hotel is well located with many taxi around.\nAir conditioning is working well.\nI ternet connection is Ok.\nJust need to add more...", "date": "October 26, 2018", "user": "Yasmine I"}, {"title": "Comfortable room, good location, great food", "review": "I stayed for 5 nights for a meeting that was held in the hotel. I found the rooms to be comfortable and clean. The food was excellent, with lots of options at breakfast. The rooftop bar was a nice place for dinner and to unwind...", "date": "October 26, 2018", "user": "ELLEN Y"}, {"title": "Stunning in every sense", "review": "I agree with the praise in the other reviews. All of it. What I find to be very stunning is that the General Manager Kenn Munyeki and his staff managed to open a four star hotel with a staff that had no what so ever...", "date": "October 25, 2018", "user": "Theclaudicola"}]}},
{"listing": {"name": "Hotel Chez Lando", "reviews": [{"title": "very helpful reception staff go above and beyond", "review": "I have stayed here twice in the last two years. This time, I was impressed by the atmosphere at the barbecue/bar. The outdoor patio offers nice meals at a decent price in a very nice ambience. The rooms were straightforward - clean, basic. The windows...", "date": "November 7, 2018", "user": "olivetreecanada"}, {"title": "Professional and friendly staff, beautiful hotel and convenient location", "review": "Chez Lando hotel in Kigali is very close to the airport, perfect location for business meeting. The rooms are clean and comfortable. The meeting rooms are great. Above all the staff at each section, front desk, restaurant, conference room, room attendants are very helpful and...", "date": "July 24, 2018", "user": "TGReviews"}, {"title": "Good food, great rooms, great service", "review": "good and private balconies, great food, great location. You can actually stay in your hotel room and work with minimal interruptions. they have great food and great service both at the restaurant and room service.", "date": "September 16, 2018", "user": "Jannynjesh"}, {"title": "Nice place to stay in Kigali.", "review": "It was my second time here. The hotel is nice, large clean rooms and bathroom and the staff are very attentive. It's close to airport and there are shops and forex bureau nearby. You also have bar/restaurant inside the hotel where you can either have...", "date": "August 20, 2018", "user": "XavierSurinyach S"}, {"title": "Very nice place to stay", "review": "The hotel is nice, clean and the staff are very attentive. I have stayed there many times and I have always had the support of its staff. The internet connection was good. you also have bar/restaurant inside the hotel where you can either have a...", "date": "August 16, 2018", "user": "dmn709"}]}},
{"listing": {"name": "Radisson Blu Hotel & Convention Centre, Kigali", "reviews": [{"title": "Perfect location, great smiles and family atmosphere", "review": "The staff at this hotel gives you more solutions than problems, which has become rare in big hotels these days. Very professional. Especially when one (me) loses their room key every 5 minutes and you are still greeted by smiles at the reception as they...", "date": "November 7, 2018", "user": "Jeff0712"}, {"title": "\"Welcome from your home... to your home\"", "review": "Thats was the phrase that made the difference, the first thing I heard after a very tiring flight. and actually it was true cause for the last 6 months I have stayed there for 4 times. \nHowever, a familiar face from the reception made me...", "date": "November 7, 2018", "user": "Eftichia P"}, {"title": "Unprofessional staff for \"5 star\" hotel", "review": "The hotel messed up our special dinner for 14 people in our group for both nights of our stay. For first night they said the paid dinner was for second night. So we paid for the dinner. For the second night they said our dinner...", "date": "November 6, 2018", "user": "Pioneer48021656092"}, {"title": " Best business hotel in Kigali perfect for the conference center", "review": "The hotel is only a few years old; it’s modern, bright, cheerfully appointed and well maintained. The Kigali convention center is 20 m across the entry drive. \nRoom size is like most Radissons and the basics are excellent with high quality beds, bedding, lighting, desk,...", "date": "November 4, 2018", "user": "Bill1andBill2"}, {"title": "Honorable Simon  J. Gill", "review": "My days at RADISSON BLU HOTEL AND INTERNATIONAL CONFERENCE CENTRE was superb. \n\nSpecial mention goes to the Front Office Team under the highly Professional leadership of the Front Office Manager, Ms. EUMULISA, it was just amazing! \n\nGood to mention the human touch of the restaurant,...", "date": "November 2, 2018", "user": "Climber35678641695"}]}},
{"listing": {"name": "Lake Kivu Serena Hotel", "reviews": [{"title": "Serenity", "review": "A beautiful property! Some rooms overlook the garden others the pool and the lake. During the weekend Friday and Saturday nights it can be very noisy in the rooms overlooking the pool because there is a band and there are beach parties. The staff are...", "date": "September 30, 2018", "user": "Keracare"}, {"title": "Just average hotel ", "review": "This hotel in a spectacular setting needs updating. Staff could not have tried harder  but that couldn’t make up for rooms that smelled musty, bathrooms that had tile and grout issues and buffet food that was dried out and unappealing. The promised 8 am boat...", "date": "September 15, 2018", "user": "Lissa K"}, {"title": "Nice hotel in Gisenyi", "review": "My stay at the hotel was a bit odd as the Presidents of Rwanda and Mozambique checked in the same day I did.  Apparently the Serena chain is where VIP's stay.  Despite the increased security, I was warmly welcomed.  My room was large and nicely...", "date": "September 14, 2018", "user": "Mark L"}, {"title": "Enjoying the vibes from Lake Kivu", "review": "The staff at Kivu Serena Hotel are well organised and welcoming! We really loved the food and service. We will come back soon before 2018 ends....thanks to Management and staff team for taking care of us. Cheers", "date": "September 10, 2018", "user": "Ngoga"}, {"title": "Needs an Upgrade", "review": "Firstly, I am generally a fan of the Serena group of hotels. In most places they are very much the Hilton of Africa. However, this outpost has seemingly been abandoned. \n\nThe beds have ancient mattresses. The rooms are overpriced for what you get and compared...", "date": "September 3, 2018", "user": "John M"}]}},
{"listing": {"name": "5 Swiss Hotel", "reviews": [{"title": "One of the best hotels in Kigali", "review": "The hotel combines comfortable rooms with exceptional and personal service. The staff are always ready to help with a genuine smile. The personal touch makes it one of the best hotels in Kigali for longer stays. Also the restaurant serves good food and they are...", "date": "July 29, 2018", "user": "maurits852"}, {"title": "Amazing. Perfect. The best quality/price relationship in Kigali", "review": "Fantastic staff. Really clean. Room with mosquito net, AC, big comfortable bed. New rooms. I was here for a business trip, alone. Just excellent in everything. I was at Serena Hotel before, but I prefer 5 Swiss Hotel, as much more friendly, cozy with super...", "date": "June 9, 2018", "user": "cloe b"}, {"title": "Home abroad", "review": "I have just checked out of this absolutely pleasant experience which lasted 8 days. This hotel is cared for by its owner as his own house and he treats his guests as friends and his staff as family. This becomes obvious by the everlasting smiles...", "date": "June 5, 2018", "user": "Marcelo L"}, {"title": "Revisiting Kigali", "review": "I returned to the 5 Swiss to find they had expanded the restaurant menu, added two new upper floor rooms with good views over the city and were working on creating a gym for clients. A friendly and ever helpful staff make this place a...", "date": "May 26, 2018", "user": "David M"}, {"title": "Perfect 2 day visit", "review": "Walked in looking for accomodation as we had flown in that morning.  It was a perfect hotel which is so clean and well maintained.  The food is delicious.  Sharon and the manager are absolutely amazing not to mention William the hotel owner who took time...", "date": "April 30, 2018", "user": "Sophie N"}]}},
{"listing": {"name": "Golf Hills Residence", "reviews": [{"title": "First night in Kigali", "review": "An interesting hotel, pretty quiet location with beautiful views over city, old and quirky, lovely staff, terrific value for a very comfortable night. Don't stay if you're super fussy and annoyingly particular though..yes it is old and with that you get some imperfections. (leaking shower..could't...", "date": "January 29, 2018", "user": "Libbl"}, {"title": "Quiet location, friendly staff and amazing food", "review": "Golfhills residence felt very homely. My colleague and I traveled to Rwanda for business and stayed at Golfhills for 2 weeks. There was a balcony and sofas close to the entrance where my colleague and I could meet up to discuss work. Staff was very...", "date": "November 19, 2017", "user": "Christina M"}, {"title": "Friendly, Flexible Staff", "review": "I visited Golf Hills after spending a week in Uganda tracking chimpanzees and gorillas. I was ready for a relaxed, comfortable couple of days, and the hotel delivered.\n\nI stayed in Room No. 6, which is probably the best room in the hotel. I asked...", "date": "June 18, 2017", "user": "MarkColin"}, {"title": "Excellent Service", "review": "The standards of GHR's rooms were high - we had no issues with hot water or anything of the sort in our four rooms. At $100 for a double, prices are more than fair for Kigali. Airport pick-up is included free of charge (although drop-off...", "date": "March 30, 2017", "user": "LifeThroughALens"}, {"title": "Not a bad place, but not what I expected", "review": "I stayed at Golf Hills because it was the only decent affordable option I found in Kigali. The location in Nyutarama is very quiet and residential so it is a nice place to walk but there is really nothing do around - I highly recommend...", "date": "January 29, 2017", "user": "Rahul P"}]}},
{"listing": {"name": "Hotel Des Mille Collines", "reviews": [{"title": "Lunch ", "review": "Had lunch for 3 days during the last 2 weeks and was not disappointed. The poolside ambience is great and food too whether it’s buffet or off the menu. Very friendly staff and good service. A place not to be missed on a trip to...", "date": "November 6, 2018", "user": "Rohpro"}, {"title": "Historical Hotel on the hill", "review": "The hotel, formally owned by Sabena, the former National Airline of Belgium. It feels old and to a certain extend it is. The rooms are ok. The bathrooms (shower in the bath with a curtain) is very outdated. I hear the hotel is up for...", "date": "November 3, 2018", "user": "Mark B"}, {"title": "Another brilliant stay", "review": "What can I say? I wouldn't stay anywhere else in Kigali. Very friendly staff, excellent premises, great food, and always a good way to pay our respects in relation to the events of 1994, as this hotel was a key part of it and by...", "date": "October 27, 2018", "user": "DuarteP"}, {"title": "Good service, comfortable", "review": "The service was very good. The room was comfortable and had what I needed. Room was clean. I loved the fresh passion fruit juice and delicious Rwandan coffee each morning. The staff were friendly and helpful. I gave it four stars, the rooms are a...", "date": "October 15, 2018", "user": "1TravelerfromTexas1"}, {"title": "Top marks for location, views, history and potential. The rest is average at best.", "review": "I was looking forward to staying in this historic hotel ever since I first watched the movie Hotel Rwanda. The drive from the airport (by taxi) took about 30 minutes and gave a good overview of the city. The arrival at the hotel was a...", "date": "October 15, 2018", "user": "XNAChris"}]}},
{"listing": {"name": "Lemigo Hotel", "reviews": [{"title": "Good location near Kigali Convention Centre", "review": "Most important things are right: service is friendly, room clean and spacious, breakfast ok and hot water was available whenever I took a shower. Wifi was decent all over the hotel. The facility is quite a labyrinth due to the fact that they have expanded...", "date": "October 9, 2018", "user": "eskolius"}, {"title": "Room service nightmare!", "review": "The room cleaning staff literally wake you up at 7 am to ask you what time you will leave so they can begin to clean the rooms. I have never experienced this before and it is unacceptable. They will not stop knocking even when you...", "date": "September 16, 2018", "user": "Jannynjesh"}, {"title": "Amazing experience for the business traveler ", "review": "This is definitely a great place to come and do conference tourism. \n\nI have enjoyed every bit of the stay at Lemigo. \n\nThe quite. The hospitality. The courtesy of the hotel staff. All these make it a pleasant stay.", "date": "August 28, 2018", "user": "gnyabera"}, {"title": "An amazing experience in Kigali", "review": "Lemigo hotel was one of the best hotel's that offered me the best experience in Kigali from their front office staff Nadia and Peace to the beautiful ladies adorned in Rwandese traditional attire welcoming you with a smile and a glass of fresh cold juice....", "date": "August 27, 2018", "user": "Hart P"}, {"title": "Friendly, helpful, excellent, comfortable", "review": "I like the Lemigo hotel a lot. Pros: Both regular and deluxe rooms are spacious, clean and comfortable; many have nice views of the city. Breakfast is excellent, diverse and plentiful. It's close to the convention center and some good tourist restaurants and shopping. The...", "date": "June 5, 2018", "user": "Epiann"}]}},
{"listing": {"name": "The Garden Place Hotel", "reviews": [{"title": "Pleasant and comfortable", "review": "Stayed one night while in Ruhengeri for the Golden Monkey Trek (which was great!), and had a good experience. The staff members were friendly, especially Franc; the room was clean; a light breakfast of fruit, toast, cereal, coffee, and juice was served starting at 6am...", "date": "August 5, 2018", "user": "Brittany_11_10"}, {"title": "I never stay anywhere else!", "review": "Another excellent visit. This Diocesan hotel never ceases to amaze me. The standard of the rooms and the service is wonderful. Chef Theo cooks very good food and Manager Emmanuel cares deeply for his guests.", "date": "June 1, 2018", "user": "jderrick21"}, {"title": "Great and Quiet Placs", "review": "My familyand I visited this hotel and really emjoyed our one night stay. \n\nThe hotel is modern clean and quiet.\n\nThe staff were friendly amd responsive to our needs.\n\nThe room was clean and well arranged and the beds very comfy.\n\nThe food was excellent...", "date": "April 3, 2018", "user": "Kibe K"}, {"title": "Still Excellent!", "review": "This is the fifth time I have spent a week in this hotel. The standard remains very high and the staff are still wonderful! There is always a welcome from Emmanuel the manager and Theo continues to cook very good food. Again, I shall be...", "date": "December 23, 2017", "user": "jderrick21"}, {"title": "Good location. Basic hotel, Almost vacant.", "review": "This hotel has good access for gorilla trekking at Volcanoes National Park about 30 minute drive away and is right in town so easy access to ATMs etc. The hotel is very basic and there was only 1 other couple there at the same time...", "date": "October 8, 2017", "user": "banditoo"}]}},
{"listing": {"name": "Iris Guesthouse", "reviews": [{"title": "My Reservation of 6 months was not held!!", "review": "I WAS a repeat customer of the Iris Guesthouse and previously gave a very positive review. Sadly this time was much different. I booked the 3 bedroom apartment 6 months in advance. I confirmed the reservation with the hotel manager two weeks before our scheduled...", "date": "August 27, 2018", "user": "jaredkidder"}, {"title": "Quiet place in the center", "review": "This is my second stay here and the impression is still good. The hotel is located in the heart of Kigali but in a quiet residential area (not far from the President House). I was surprised to wake up in middle of Kigali to the...", "date": "January 5, 2018", "user": "orriman"}, {"title": "Just right!", "review": "We stayed here for two nights and it proved an ideal base during our visit to Kigali. The staff were friendly, the place was clean and food was generally good. It's in a very nice part of town albeit not quite within reasonable walking distance...", "date": "September 6, 2017", "user": "VivienneH117"}, {"title": "Delightful guest house", "review": "The rooms are small, but clean and comfortable with a small sitting area outside the room. For the price, this is an excellent choice. The breakfast was good and the staff friendly and helpful. Locations is close to town.", "date": "July 16, 2017", "user": "Deborah M"}, {"title": "Great homebase for our trip!", "review": "I stayed here for 11 nights and was out each day on various day trips.  The staff is extremely nice and very helpful!  I will miss the morning smiles and welcomes from Christopher. They accommodated all of our needs.  The restaurant was a nice place...", "date": "July 6, 2017", "user": "travelgirldreamer"}]}},
{"listing": {"name": "Lebanon Hotel", "reviews": [{"title": "Awesome Service! Awesome staff!", "review": "You have excellent customer service that is tailored to meet your customers requirements. You have nice and quiet rooms and very friendly and courteous staff right from the reception to the restaurant. Nice food and free internet that works. You provided me with free pickups...", "date": "November 4, 2018", "user": "AnthonyK2030"}, {"title": "Highly recommended!", "review": "Very good Hotel not too far from the airport. Nice and modern rooms. Free airport pick up and drop off is included. The internet works excellent. The staff are very helpful, obliging and friendly. They try to make your stay as convenient as possible.", "date": "October 17, 2018", "user": "fuerst17"}, {"title": "Best Hotel to be in Kigali", "review": "The customer service is excellent from the reception to kitchen and room service.\n\nFriendly staff.\n\nGood and well prepared nutritious food.\n\nInternet service excellent. \nRooms are beautiful  and give class to the customers. \n\nGood communication skills displayed by the staff in the kitchen,reception and others...", "date": "October 4, 2018", "user": "jeannie416"}, {"title": "Amazing Service and Amazing People", "review": "I had stayed in Lebanon Hotel from 24th to 28th September. It was a late evening flight from India so it was a sleepless night in the flight. When we reached Kigali at 4:30 am, all we wanted was a bed to sleep. We quickly...", "date": "September 30, 2018", "user": "sales566"}, {"title": "Best place to be in Kigali", "review": "Employees are so kind and professionnels\nRooms and leaving places are clean and well done on daily basis\nEnvironnement is calm and good for a better rest\nFood is nice and well make\nPool is clean with clear water and professional Master\nSauna is good...", "date": "September 28, 2018", "user": "RochMbanya"}]}},
{"listing": {"name": "Urban by CityBlue Kigali, Rwanda", "reviews": [{"title": "Nothing Special", "review": "This hotel could be anywhere in the world. It's a concrete block in an upmarket part of Kigali, just around the corner from the Presidential Palace. Everyone raves about the views from the top of the hotel; but, they aren't anything special. Yes, you can...", "date": "October 14, 2018", "user": "kbr88"}, {"title": "Rooms in main building are excellent", "review": "Stayed here twice. The rooms in the main building are so nice. Modern, clean, spacious. The rooms in the annex not so. Restaurant is great, especially the breakfast staff who were always really lovely!", "date": "October 10, 2018", "user": "gohabsgo81"}, {"title": "Well located, modern boutique hotel", "review": "We stayed here for one night in late Sept. 2018. The location of the hotel is great and is within walking distance of many good restaurants and shopping for basics or other items that you may need or have forgotten plus it's a lovely neighbourhood...", "date": "October 2, 2018", "user": "absmtl"}, {"title": "Nice stay ", "review": "The room was nice and the hotel is in a quiet neighborhood, I would stay here again if I happen to visit Kigali again. Kigali is a clean city and very organized. We also did the tour to the genocide memorial center and it was...", "date": "September 16, 2018", "user": "Zepata"}, {"title": "Average administration", "review": "We were supposed to be picked up from the airport but no one turned up. The hotel was clean and the breakfast was good. But the front desk staff seem to be confused about the booking arrangements (there were 3 of us)", "date": "September 3, 2018", "user": "Factfinder90"}]}},
{"listing": {"name": "Hotel Muhabura", "reviews": [{"title": "Average hotel", "review": "The room was large, which is nice. However the restaurant was not good. A lot of the food on the menu was not available, and what was available was worse than what we had elsewhere during our holiday. No wifi in our room. It was...", "date": "November 4, 2018", "user": "Didianarana"}, {"title": "A Special Place", "review": "The Muhabura Hotel has a storied history because of its vintage from the 1950s and Dian Fossey's habit of staying there. Her favourite room #12 is a museum piece now. Staying in the hotel is like a throwback to a bygone era, and one has...", "date": "February 3, 2018", "user": "bcsanders"}, {"title": "Quirky but fading hotel", "review": "This 60-year old tourist facility is showing its age. Quirky place, could do with an overhaul. Having said that, it has generous sized rooms, a nice garden with several birds I hadn't seen before, a good bar on the terrace and pretty good service. The...", "date": "December 10, 2017", "user": "Chris S"}, {"title": "Great to stay at Diane Fossey’s éconduit home", "review": "I stayed just the one night after crossing the border from Uganda . Good WiFi in the bar/dining area . Accommodation was good , staff were all friendly and helpful . There was a good choice of food and it was very tasty . Of...", "date": "November 16, 2017", "user": "billpam56"}, {"title": "poor accomodation, poor food and non existant service.", "review": "on a trip where we stayed at some excellent accomodation this was a disaster. We arrived after a long journey from Uganda to be shown to a \"room\"/ cupboard where the bed was nearly the same size as the room, we initially unpacked ,I went...", "date": "September 2, 2017", "user": "wob58"}]}},
{"listing": {"name": "Onomo Hotel Kigali", "reviews": [{"title": "I would say... Meh", "review": "The hotel looks almost great, I must reiterate: ALMOST! Service is poor, slow and undisciplined (my room and the room from a colleague of mine were cleaned up but no towels were left) but, important to say, staff is very polite and are always smiling....", "date": "November 7, 2018", "user": "bioveiga2"}, {"title": "A home away from home", "review": "I love this hotel. After 5 nights here, I felt like I knew everyone. The people are so warm and hospitable. And you have to try Chef Claude’s pork shank. Heavenly. Yummy!!! Ooolala. All the herbs are grown in the organic garden behind the hotel....", "date": "November 7, 2018", "user": "PentaK"}, {"title": "Great stay...not so great checkout", "review": "I had a lovely two-and-a-half week stay at Onomo. I was working at a conference as a consultant. The new South African manager was a wonderful lady - so welcoming and pleasant. This made me feel at home and made this relatively long stint away...", "date": "November 3, 2018", "user": "Yvette O"}, {"title": "Good rooms, clean and quiet. Staff improvements to achieve, in restaurant area poor. Food offer too poor", "review": "Special greetings to barman MR WHY NOT - competent and gentle.\nHotel needs better management, discipline a custom care.\nRwanda deserves better hotel employees\ni know other Onomo facilities and i am happy - \nplease respect Rwandese people.", "date": "November 2, 2018", "user": "Connector65555230414"}, {"title": "terrible servicew", "review": "same time they can make two iv and just say sorry but working efficency is so slowly ,even cheating.....everyone is laying and not serise aboout mistake....tell me soon but after long time than reply slowly...how the hotel like this can surviral？！1", "date": "October 17, 2018", "user": "子纹 贺"}]}},
{"listing": {"name": "The Manor Hotel", "reviews": [{"title": "Amazing Service", "review": "We are thankful to The Manor Hotel Kigali for the great service and professionalism.\nWe enjoyed every bit of our stay and we shall not shy away from recognizing and recommending you to the world.\nThank you \nNeza Safaris", "date": "October 27, 2018", "user": "Neza S"}, {"title": "The best customer care and clean environment", "review": "My four days stay at the Manor hotel was full of awesome experience the fact that the staff is so caring and the place is so clean. Wow.\nCan't wait to be in Kigali again and enjoy the best accommodation in Rwanda.", "date": "October 12, 2018", "user": "Watson A"}, {"title": "Execellent Staff, beatiful view and great food", "review": "The Manor is situated in an upscale suburb in Kigali. The structure is a bit old however the warm staff, excellent view, and great food made up for it. All major cards are accepted. One can have Indian, oriental and Italian cuisine. There is a...", "date": "October 11, 2018", "user": "MorganM1537"}, {"title": "zakelijk bezoek Kigali", "review": "I used The Manor as base for business activities in Kigali. Good location, nice view. Hotel simple not fancy. No luxury in terms of finish of the room, but basically adequate. Good food, pleasant staff and pleasant owner management.", "date": "September 15, 2018", "user": "hle2018"}, {"title": "Service and Hotel staff was very good", "review": "Excellent hotel and food was awesome. Hotel staff is very honest and soft spoken. Service was very nice and hotel location is very cool. My room was in front facing and view from my room was amazing. I will give five out of five ratings...", "date": "September 3, 2018", "user": "Dreamer239834"}]}},
{"listing": {"name": "CityBlue EPIC Hotel & Suites", "reviews": [{"title": "Will Definitely Return", "review": "Only stayed one night ( Unfortunately !)\nRooms are spacious , very well laid out, and the standard of linen , toweling and room fixtures very good. Room had a balcony , and I enjoyed sitting outside enjoying the peace and view, Food was excellent,...", "date": "November 2, 2018", "user": "WesselBenson"}, {"title": "Tennis player", "review": "Gorgeous and marvelous service at the location. We had a tennis tournament iver the weekend amd stayed there. Place is 5 star ⭐️, great service and a place to rest for real- on the Eastern part of #Rwanda", "date": "October 31, 2018", "user": "Patrick S"}, {"title": "The one problem in Rwanda: Communication", "review": "The Hotel is in the middle of nowhere! New, neat, clean, big. \nA business Hotel with amenities for meeting and congresses, so don't go for honey moon.\nWe just stayed one night, had dinner.\nNice views into the landscape from rooms and dining area on...", "date": "October 28, 2018", "user": "Theclaudicola"}, {"title": "Citi Blue Epic", "review": "An put off the way hotel which exceeds all factors. The views are amazing,  the service exceptional and a pleasant dining experience. The entire staff troops over themselves to ensure the stay is comfortable. Well done.", "date": "October 19, 2018", "user": "jimfin6"}, {"title": "A bit incongruous but very comfortable ", "review": "Plonked down on the edge of town this hotel couldn’t be more out of place. Who comes here?? Well, I guess we did. You'll get a huge room, a balcony, acres of shiny marble (?) corridors and a swimming pool seemingly mainly used as a...", "date": "October 13, 2018", "user": "Martin D"}]}},
{"listing": {"name": "Gorillas Golf Hotel", "reviews": [{"title": "Great hotel for a Kigali layover", "review": "Just spent one night here enroute to Gorilla Trekking. It was a relatively short taxi ride from the airport (10-15 minutes), which the hotel arranged for us as we had a late night arrival. The room was clean and the bed comfortable. The breakfast the...", "date": "October 22, 2018", "user": "WHERESWAUGH"}, {"title": "Good hotel ", "review": "Spent a week at this hotel for work and I’d recommend it. The rooms were decent and the food was quite good. There is a beautiful pool as well that I enjoyed. It’s not a very fancy hotel but it’s decent value for the money.", "date": "October 13, 2018", "user": "Canucksnowflake"}, {"title": "Serenity", "review": "In very serene environment, very well kept property and extremely clean. The rooms are comfortable, I stayed in one overlooking the swimming pool and rolling hills yonder. Staff are very courteous. Great food and the buffet breakfast was wonderful. Reasonably good workshop rooms. The gym...", "date": "October 2, 2018", "user": "David W"}, {"title": "Comfortable, quiet", "review": "I recently spent two nights at this hotel as I was in the city for work. The hotel is staffed 24 hours, which was helpful given that my flight arrived after midnight. I had a little difficulty connecting to the wireless and the desk attendant...", "date": "September 28, 2018", "user": "Karen W"}, {"title": "Quiet and Relaxing", "review": "The hotel is situated in a very quiet location with some nice views over the city.  The double room was very clean and comfortable with plenty of storage space.  The meals in the hotel restaurant were well prepared and plentiful, the staff were very attentive....", "date": "May 18, 2018", "user": "Garry B"}]}},
{"listing": {"name": "One&Only Nyungwe House", "reviews": [{"title": "First class experience", "review": "An absolutely amazing place! \n✔️Stunning views\n✔️High end facilities \n✔️Amazing service\n✔️Delicious food\n✔️Perfect place for romantic weekend\n\nThe best place in Rwanda to rest, relax and calm down surrounded by nature with the highest class service. The staff is exceptional - they take care...", "date": "November 1, 2018", "user": "gladys_headway"}, {"title": "Serenity and Luxury at it's best", "review": "For the traveller looking to try something new or different. For the person longing to experience the majesty of Africa. The view, the scents, the tranquility, the drums. There's truly nothing like it. Try it. The resort is set in the middle of an active...", "date": "October 23, 2018", "user": "Caroline M"}, {"title": "Heaven on earth...", "review": "After accepting an invitation to visit Rwanda I knew I wanted to take sometime on the backend to enjoy the beauty and well, relax. I immediately checked the One and Only to see if they had a presence in Rwanda. Sure enough One and Only...", "date": "October 22, 2018", "user": "tracysQ1075TX"}, {"title": "Wow Wow Wow", "review": "What a magnificent place! A special thanks to Jarque for hosting us, Igor for the delicious cocktails, Treasure for THE most outstanding food & Omar for the top notch meal service! Our stay was extremely enjoyable and we look forward to coming back in the...", "date": "October 16, 2018", "user": "Hannah R"}, {"title": "Over the top ....", "review": "Just close your eyes and image a beautiful, modern, yet classic wooden house (resort) situated on top of a large tea plantation bordering with the Nuyngwe National Rainforest. It is not easy to get there, but once you are there, you are in paradise. The...", "date": "February 28, 2018", "user": "P H"}]}},
{"listing": {"name": "Hotel Villa Portofino Kigali", "reviews": [{"title": "Great Experience", "review": "I was on abusiness trip when i stayed at the hotel which was booked via Jumia Travel.  The hotel has spacious rooms, very clean and well maintained. The meals are superb and well done. The staff are extremely helpful and friendly!", "date": "October 12, 2018", "user": "Laureen R"}, {"title": "Looks good from a distance", "review": "The Hotel Villa Portofino perches on a hillside (like most of Kigali), offering views of the downtown skyline from the restaurant, café, and pool deck terraces.\n\nThe café serves decent cappuccino and plays a mixture of Spanish telenovelas and English football on two different flat...", "date": "August 31, 2018", "user": "olivetreecanada"}, {"title": "Super friendly place - would stay again!", "review": "We stayed here for a work conference and the staff could not have been more friendly and accommodating... they really went out of their way to make your\n\nBuffet meals (breakfast and lunch) were good with wide variety. Evening meals took a long time to...", "date": "August 31, 2018", "user": "Londontraveller7484"}, {"title": "“ Amazing swimming pool “", "review": "Excellent floor service, what I definitely liked the most was the clean and well-maintained swimming pool, excellent food but somehow limited choice, clean and welcoming rooms with comfortable beds, secured parking.", "date": "August 8, 2018", "user": "Thomy O"}, {"title": "RWANDA DARLING - AMAZING PLACE", "review": "This hotel provides a very warm service, staff are always at your service and they do everything with a smile especially Geoffrey who worked tirelessly to ensure our conference was a success. Stanley the manager was also very supportive. The hotel provides all comfort, very...", "date": "July 15, 2018", "user": "Bernice J"}]}}
]